## 762579868088: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cbs_conformance_pack will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cbs_conformance_pack"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            ##################################################################################
            #                                                                                 
            #   Conformance Pack:                                                             
            #     Canadian Centre for Cyber Security (CCCS) Cloud Based Sensor (CBS)                                
            #                                                                                 
            #   This conformance pack helps verify compliance with CBS requirements.   
            #                                                                                 
            #   See Parameters section for names and descriptions of required parameters.     
            #                                                                                 
            ##################################################################################
            
            Resources:
              CloudtrailEnabled:
                Properties:
                  ConfigRuleName: cbs_cloudtrail_enabled
                  Description: A Config rule that checks that CloudTrail is enabled and logging to a given bucket.
                  InputParameters:
                    s3BucketName: ${satellite_logging_bucket}
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::CloudTrail::Trail
                  Source:
                    Owner: AWS
                    SourceIdentifier: CLOUD_TRAIL_ENABLED
                Type: AWS::Config::ConfigRule
              ElbLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_elb_logging_enabled
                  Description: A Config rule that checks whether load balancer logging is enabled
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::ElasticLoadBalancing::LoadBalancer
                      - AWS::ElasticLoadBalancingV2::LoadBalancer
                  Source:
                    Owner: AWS
                    SourceIdentifier: ELB_LOGGING_ENABLED
                Type: AWS::Config::ConfigRule
              S3SatelliteBucket:
                Properties:
                  ConfigRuleName: cbs_s3_satellite_bucket_rule
                  Description: Checks that the CBS satellite bucket exists in the account.
                  InputParameters:
                    satelliteBucket: ${satellite_logging_bucket}
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: ${cbs_s3_satellite_bucket_rule_lambda_arn}
                Type: AWS::Config::ConfigRule
              VpcFlowLogsEnabled:
                Properties:
                  ConfigRuleName: cbs_vpc_flow_logging_enabled
                  Description: A Config rule that checks whether VPC flow logs are enabled.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::EC2::VPC
                  Source:
                    Owner: AWS
                    SourceIdentifier: VPC_FLOW_LOGS_ENABLED
                Type: AWS::Config::ConfigRule
              WAFv2LoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_wafv2_logs_rule
                  Description: Checks that the WAFV2 ACL's are logging to either S3 or Kinesis.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::WAFv2::WebACL
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: ${cbs_wafv2_logs_rule_lambda_arn}
                Type: AWS::Config::ConfigRule
        EOT
      + vars     = {
          + "cbs_s3_satellite_bucket_rule_lambda_arn" = (known after apply)
          + "cbs_wafv2_logs_rule_lambda_arn"          = (known after apply)
          + "satellite_logging_bucket"                = "cbs-satellite-762579868088"
        }
    }

  # aws_cloudwatch_log_group.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_s3_satellite_bucket_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/CbsS3SatelliteBucketRule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.cbs_wafv2_logs_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_wafv2_logs_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cbs-wafv2-logs-rule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
    }

  # aws_config_conformance_pack.cbs will be created
  + resource "aws_config_conformance_pack" "cbs" {
      + arn           = (known after apply)
      + id            = (known after apply)
      + name          = "cloud-based-sensor"
      + template_body = (known after apply)
    }

  # aws_iam_policy.aws_config_policy will be created
  + resource "aws_iam_policy" "aws_config_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CbsConfigPolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketLogging",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "wafv2:PutLoggingConfiguration",
                          + "wafv2:GetLoggingConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:wafv2:::*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.s3_list_buckets will be created
  + resource "aws_iam_policy" "s3_list_buckets" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all S3 buckets"
      + id          = (known after apply)
      + name        = "CbsS3ListBuckets"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.wafv2_list_web_acls will be created
  + resource "aws_iam_policy" "wafv2_list_web_acls" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all WAFv2 ACLs"
      + id          = (known after apply)
      + name        = "cbs-wafv2-acls-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "wafv2:ListWebACLs",
                          + "wafv2:ListLoggingConfigurations",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetLoggingConfiguration",
                          + "iam:CreateServiceLinkedRole",
                          + "config:PutEvaluations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy_attachment.aws-aws_config_policy-policy will be created
  + resource "aws_iam_policy_attachment" "aws-aws_config_policy-policy" {
      + id         = (known after apply)
      + name       = "CbsConfigPolicy"
      + policy_arn = (known after apply)
      + roles      = [
          + "CbsConfigPolicy",
        ]
    }

  # aws_iam_role.cbs_wafv2_logs_rule will be created
  + resource "aws_iam_role" "cbs_wafv2_logs_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cbs-wafv2-logs-rule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_satellite_bucket_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "CbsS3SatelliteBucketRule"
    }

  # aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_s3_list_buckets will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_satellite_bucket_rule_s3_list_buckets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsS3SatelliteBucketRule"
    }

  # aws_iam_role_policy_attachment.cbs_wafv2_logs_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_wafv2_logs_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "cbs-wafv2-logs-rule"
    }

  # aws_iam_role_policy_attachment.cbs_wafv2_logs_rule_wafv2_list_web_acls will be created
  + resource "aws_iam_role_policy_attachment" "cbs_wafv2_logs_rule_wafv2_list_web_acls" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cbs-wafv2-logs-rule"
    }

  # aws_lambda_function.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_lambda_function" "cbs_s3_satellite_bucket_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_s3_satellite_bucket_rule.zip"
      + function_name                  = "CbsS3SatelliteBucketRule"
      + handler                        = "s3_satellite_bucket_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::762579868088:role/CbsS3SatelliteBucketRule"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "i7UKalirZX27DnlHTzMuGMD+/ZZhoaHhUgRbtbBuUFk="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.cbs_wafv2_logs_rule will be created
  + resource "aws_lambda_function" "cbs_wafv2_logs_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_wafv2_logs_rule.zip"
      + function_name                  = "cbs-wafv2-logs-rule"
      + handler                        = "webacl_logs_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "jCX9PDXvZOdK1lA3jzrkKwYGm7iYzRHZHz0MCw5UeKo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-762579868088"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_lambda_permission" "cbs_s3_satellite_bucket_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

  # aws_lambda_permission.cbs_wafv2_logs_rule will be created
  + resource "aws_lambda_permission" "cbs_wafv2_logs_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
